var bagua = [{
	'code': '111',
	"name": "乾",
	"num": 1,
	"main": "天",
	"wuxing": "1"
}, {
	'code': '010',
	"name": "坎",
	"num": 6,
	"main": "水",
	"wuxing": "2"
}, {
	'code': '100',
	"name": "艮",
	"num": 7,
	"main": "山",
	"wuxing": "5"
}, {
	'code': '001',
	"name": "震",
	"num": 4,
	"main": "雷",
	"wuxing": "3"
}, {
	'code': '110',
	"name": "巽",
	"num": 5,
	"main": "风",
	"wuxing": "3"
}, {
	'code': '101',
	"name": "离",
	"num": 3,
	"main": "火",
	"wuxing": "4"
}, {
	'code': '000',
	"name": "坤",
	"num": 8,
	"main": "地",
	"wuxing": "5"
}, {
	'code': '011',
	"name": "兑",
	"num": 2,
	"main": "泽",
	"wuxing": "1"
}];
var guaData = [{
	"code": "111111",
	"name": "乾",
	"main": "",
	"dis": "乾为天",
	"content": [
		"乾：元，亨，利，贞。",
		"初九：潜龙勿用。",
		"九二：见龙在田，利见大人。",
		"九三：君子终日乾乾，夕惕若厉，无咎。",
		"九四：或跃在渊，无咎。",
		"九五：飞龙在天，利见大人。",
		"上九：亢龙有悔。",
		'用九，见群龙无首，吉。'
	],
	"xiang": "象曰：天行健，君子以自强不息。",
	"exp": [
		"大吉大利",
		"龙还潜伏着，时机不成熟，还没准备好，不能轻易出手。强调事物初期要做好准备",
		"龙出现在田野上，龙伸展了，要有活动了，可以有所行动，时机基本成熟了。利益出现在面前。",
		"君子应该每日自强不息，努力，晚上高度紧张，警惕，即使遇到危险，也不会有什么大的过失。",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000000",
	"name": "坤",
	"dis": "坤为地",
	"main": "像大地一样广大，包容，顺从",
	"content": [
		"坤：元亨，利牝马之贞。君子有攸往，先迷后得主，利；西南得朋，东北丧朋，安贞吉。",
		"初六，履霜，坚冰至。",
		"六二，直方大，不习无不利。",
		"六三，含章可贞，或从王事，无成有终。",
		"六四，括囊，无咎无誉。",
		"六五，黄裳，元吉。",
		"上六，龙战于野，其血玄黄。",
		"用六，利永贞。"
	],
	"xiang": "象曰：地势坤；君子以厚德载物。",
	"exp": [
		"大吉大利，利于母马的占卜（贞）。君子（皇帝、丈夫）要干什么事，如果你（臣、妻）先于他就会迷失,如果你后于他就能得到,朋（朋友、钱），安于占卜结果就会大吉。别逞能，顺着领导，顺着大势才能永久存在。顺应。顺承。",
		"看到鞋子上有霜，意味着天冷了，要结冰了。小的错误要及早改正，不然大问题就会出现。",
		"大地直方大（包容，广阔），不实践，不行动，没有功劳也没关系，没有什么不利的。",
		"有能耐要隐藏起来，不争，不出头，让给领导。",
		"勒紧口袋，闭嘴，少说，谨慎，听话就行了，无功无过。",
		"就像黄色的裳，要知道上下，摆正自己的位置。又有文采又知道分寸。",
		"和上位者斗争（争权），两败俱伤。（有非分之想）",
		"",
	]
}, {
	"code": "010001",
	"name": "屯",
	"dis": "水雷屯",
	"xiang": "象曰：云雷，屯；君子以经纶。",
	"main": "象征小草钻出大地，起步艰难。",
	"content": [
		"屯：元亨，利贞，勿用有攸往。利建侯。",
		"初九，磐桓，利居贞，利建侯。",
		"六二，屯如，邅如，乘马班如。匪寇，婚媾。女子贞不字，十年乃字。",
		"六三，即鹿无虞，惟入于林中；君子几不如舍。往吝。",
		"六四，乘马班如，求婚媾；往吉，无不利。",
		"九五，屯其膏，小贞吉，大贞凶。",
		"上六，乘马班如，泣血涟如。"
	],
	"exp": [
		"初期不能有什么大的举动。",
		"起步中的起步，徘徊，不适合有什么大的举动。适合封赏，建候。起步要找好的队友。",
		"艰难的样子，徘徊的样子，一群人坐马的样子，匪寇，抢婚。女子暂时嫁不出去，十年之内会嫁出去的。主要说是艰难，干啥都难。但是要有信心，坚持还是有希望的",
		"追逐鹿却没有向导，迷路找不到方向；不如舍弃，如果执迷不悟会陷入困境。",
		"应初九，六二也挡不住，好爻",
		"物质不多的起步阶段，干小事还可以，如果大动作可能会失败。",
		"不好，困难，哭出血了。要变，变则通 不然就会郁郁而亡。"
	]
}, {
	"code": "100010",
	"name": "蒙",
	"dis": "山水蒙",
	"xiang": "象曰：卦中爻象犯小耗，君子占之运不高，婚姻合伙有琐碎，做事必然受苦劳。",
	"main": "幼稚的状态，蒙智	刚开始弱小但清澈单纯。容易污染，所以这个阶段要有正确的引导。强调早期教育。",
	"content": [
		"蒙：亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告，利贞。",
		"初六：发蒙，利用刑人，用说桎梏，以往吝。",
		"九二：包蒙，吉。纳妇，吉，子克家。",
		"六三：勿用取女，见金夫，不有躬，无攸利。",
		"六四：困蒙，吝。",
		"六五：童蒙，吉。",
		"上九：击蒙，不利为寇，利御寇。"
	],
	"exp": [
		"亨通。不是我去求教童蒙，而是童蒙（学生）来求教我，如果第一次问告诉他，如果三番五次的问，就不用告诉了（不能频繁的问同一个问题）",
		"启发蒙智（教育的第一步，产生兴趣、独立思考能力），利用刑人（受刑罚的人）提醒他，免得以后会受到相同的刑罚。如果你要做什么事，可能不会有好结果。 先学习先准备再做事。",
		"包容，就会好。能持家",
		"不能取这个女人，见到有钱人就不顾行为，没什么好的事。 ",
		"困住了，独自一人，没有辅助没有提携。",
		"犯了糊涂也没事，努力学习没什么问题。顺从，听从指教",
		"棍棒教育，可以很严格，但不能过于凶暴。"
	]
}, {
	"code": "010111",
	"name": "需",
	"dis": "水天需",
	"xiang": "象曰：明珠土埋日久深，无光无亮到如今，忽然大风吹土去，自然显露有重新。",
	"main": "要有所期待有所等待，天上有云，还没下雨，要耐心等待。",
	"content": [
		"需：有孚，光亨，贞吉，利涉大川。",
		"初九：需于郊，利用恒，无咎。",
		"九二：需于沙，小有言，终吉。",
		"九三：需于泥，致寇至。",
		"六四：需于血，出自穴。",
		"九五：需于酒食，贞吉。",
		"上六：入于穴，有不速之客三人来，敬之终吉。"
	],
	"exp": [
		"涉大川 度过困难  不要着急。",
		"在郊外等待的时候，要有恒心，要有耐心，没有坏处",
		"离危险近了一点，等待，稍微会有一些指责、诽谤、议论什么的不要慌，最终会好的。提示自己的修养。",
		"陷入泥里了，快接触危险了，吸引来了贼寇。不要让自己陷入这种状态（把自己的弱点、不足展露出来），否则就会比较危险。",
		"有冲突了，有损伤了，要想办法从深渊中逃出。",
		"已经跨过了困难，就快成功了，再坚持就成功了。",
		"进入了危险，有意外，要恭敬、谨慎、尊重、小心翼翼。最终会好的。"
	]
}, {
	"code": "111010",
	"name": "讼",
	"dis": "天水讼",
	"xiang": "象曰：天与水违行，讼：君子以做事谋始。",
	"main": "",
	"content": [
		"讼：有孚，窒惕，中吉，终凶。利见大人，不利涉大川。",
		"初六：不永所事，小有言，终吉。",
		"九二：不克讼，归而逋。其邑人三百户，无眚。",
		"六三：食旧德，贞厉，终吉。或从王事，无成。",
		"九四：不克讼，复既命，渝。安贞，吉。",
		"九五：讼元吉。",
		"上九：或锡之鞶带，终朝三褫之。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000010",
	"name": "师",
	"dis": "地水师",
	"xiang": "象曰：地中有水，师；君子以容民畜众。",
	"main": "",
	"content": [
		"师：贞，丈人吉，无咎。",
		"初六：师出以律，否臧凶。",
		"九二：在师中，吉，无咎；王三锡命。",
		"六三：师或舆尸,凶。",
		"六四：师左次，无咎。",
		"六五：田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。",
		"上六：大君有命，开国承家,小人勿用。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "010000",
	"name": "比",
	"dis": "水地比",
	"xiang": "象曰：地上有水，比。先王以建万国，亲诸侯。",
	"main": "",
	"content": [
		"比：吉。原筮，元永贞，无咎。不宁方来。后夫凶。",
		"初六：有孚比之，无咎。有孚盈缶，终来有它，吉。",
		"六二：比之自内，贞吉。",
		"六三：比之匪人。",
		"六四：外比之，贞吉。",
		"九五：显比，王用三驱，失前禽，邑人不诫，吉。",
		"上六：比之无首，凶。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110111",
	"name": "小畜",
	"dis": "风天小畜",
	"xiang": "象曰：风行天上，小畜。君子以懿文德。",
	"main": "",
	"content": [
		"小畜：亨。密云不雨，自我西郊。",
		"初九：复自道，何其咎？吉。",
		"九二：牵复，吉。",
		"九三：舆说辐，夫妻反目。",
		"六四：有孚，血去惕出，无咎。",
		"九五：有孚挛如，富以其邻。",
		"上九：既雨既处，尚德载。妇贞厉，月几望。君子征凶。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "111011",
	"name": "履",
	"dis": "天泽履",
	"xiang": "象曰：上天下泽，履；君子以辩上下，定民志。",
	"main": "",
	"content": [
		"履：履虎尾，不人。亨。",
		"初九：素履往，无咎。",
		"九二：履道坦坦，幽人贞吉。",
		"六三：眇能视，跛能履。履虎尾，咥人，凶。武人为于大君。",
		"九四：履虎尾，愬愬。终吉。",
		"九五：夬履，贞厉。",
		"上九：视履考祥，其旋元吉。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000111",
	"name": "泰",
	"dis": "地天泰",
	"xiang": "象曰：天地交，泰；后以财成天地之道，辅相天地之宜，以左右民。",
	"main": "",
	"content": [
		"泰：小往大来，吉，亨。",
		"初九：拔茅茹，以其汇，征吉。",
		"九二：包荒，用冯河，不遐遗；朋亡，得尚于中行。",
		"九三：无平不陂，无往不复；艰贞无咎，勿恤其孚，于食有福。",
		"六四：翩翩，不富以其邻，不戒以孚。",
		"六五：帝乙归妹，以祉元吉。",
		"上六：“城复于隍”；勿用师，自邑告命，贞吝。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "111000",
	"name": "否",
	"dis": "天地否",
	"xiang": "象曰：天地不交，“否”；君子以俭德辟难，不可荣以禄。",
	"main": "",
	"content": [
		"否：否之匪人，不利君子贞，大往小来。",
		"初六：拔茅茹，以其汇，贞吉，亨。",
		"六二：包承，小人吉；大人否，亨。",
		"六三：包羞。",
		"九四：有命无咎，畴离祉。",
		"九五：休否，大人吉；其亡其亡，系于苞桑。",
		"上九：倾否；先否后喜。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "111101",
	"name": "同人",
	"dis": "天火同人",
	"xiang": "",
	"main": "",
	"content": [
		"同人：同人于野，亨，利涉大川，利君子贞。",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101111",
	"name": "大有",
	"dis": "火天大有",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000100",
	"name": "谦",
	"dis": "地山谦",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001000",
	"name": "豫",
	"dis": "雷地豫",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011001",
	"name": "随",
	"dis": "泽雷随",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100110",
	"name": "蛊",
	"dis": "山风蛊",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000011",
	"name": "临",
	"dis": "地泽临",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110000",
	"name": "观",
	"dis": "风地观",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101001",
	"name": "噬嗑",
	"dis": "火雷噬嗑",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100101",
	"name": "贲",
	"dis": "山火贲",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100000",
	"name": "剥",
	"dis": "山地剥",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000001",
	"name": "复",
	"dis": "地雷复",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "111001",
	"name": "无妄",
	"dis": "天雷无妄",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100111",
	"name": "大畜",
	"dis": "山天大畜",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100001",
	"name": "颐",
	"dis": "山雷颐",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011110",
	"name": "大过",
	"dis": "泽风大过",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "010010",
	"name": "坎",
	"dis": "坎为水",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101101",
	"name": "离",
	"dis": "离为火",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011100",
	"name": "咸",
	"dis": "泽山咸",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001110",
	"name": "恒",
	"dis": "雷风恒",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "111100",
	"name": "遁",
	"dis": "天山遁",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001111",
	"name": "大壮",
	"dis": "雷天大壮",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101000",
	"name": "晋",
	"dis": "火地晋",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000101",
	"name": "明夷",
	"dis": "地火明夷",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110101",
	"name": "家人",
	"dis": "风火家人",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101011",
	"name": "睽",
	"dis": "火泽睽",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "010100",
	"name": "蹇",
	"dis": "水山蹇",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001010",
	"name": "解",
	"dis": "雷水解",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100011",
	"name": "损",
	"dis": "山泽损",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110001",
	"name": "益",
	"dis": "风雷益",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011111",
	"name": "夬",
	"dis": "泽天夬",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "111110",
	"name": "姤",
	"dis": "天风姤",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011000",
	"name": "萃",
	"dis": "泽地萃",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000110",
	"name": "升",
	"dis": "地风升",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011010",
	"name": "困",
	"dis": "择水困",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "010110",
	"name": "井",
	"dis": "水风井",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011101",
	"name": "革",
	"dis": "泽火革",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101110",
	"name": "鼎",
	"dis": "火风鼎",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001001",
	"name": "震",
	"dis": "雷为震",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100100",
	"name": "艮",
	"dis": "山为艮",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110100",
	"name": "渐",
	"dis": "风山渐",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001011",
	"name": "归妹",
	"dis": "雷泽归妹",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001101",
	"name": "丰",
	"dis": "雷火丰",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101100",
	"name": "旅",
	"dis": "火山旅",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110110",
	"name": "巽",
	"dis": "风为巽",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011011",
	"name": "兑",
	"dis": "泽为兑",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110010",
	"name": "涣",
	"dis": "风水涣",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "010011",
	"name": "节",
	"dis": "水泽节",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110011",
	"name": "中孚",
	"dis": "风泽中孚",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001100",
	"name": "小过",
	"dis": "雷山小过",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "010101",
	"name": "既济",
	"dis": "水火既济",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101010",
	"name": "未济",
	"dis": "火水未济",
	"xiang": "",
	"main": "",
	"content": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}]
