var bagua = [{
	'code': '111',
	"name": "乾",
	"num": 1,
	"main": "天",
	"wuxing": "1"
}, {
	'code': '010',
	"name": "坎",
	"num": 6,
	"main": "水",
	"wuxing": "2"
}, {
	'code': '100',
	"name": "艮",
	"num": 7,
	"main": "山",
	"wuxing": "5"
}, {
	'code': '001',
	"name": "震",
	"num": 4,
	"main": "雷",
	"wuxing": "3"
}, {
	'code': '110',
	"name": "巽",
	"num": 5,
	"main": "风",
	"wuxing": "3"
}, {
	'code': '101',
	"name": "离",
	"num": 3,
	"main": "火",
	"wuxing": "4"
}, {
	'code': '000',
	"name": "坤",
	"num": 8,
	"main": "地",
	"wuxing": "5"
}, {
	'code': '011',
	"name": "兑",
	"num": 2,
	"main": "泽",
	"wuxing": "1"
}]

var guaData = [{
	"code":"111111",
	"name":"乾",
	"dis":"乾为天"
},{
	"code":"000000",
	"name":"坤",
	"dis":"坤为地"
},{
	"code":"010001",
	"name":"屯",
	"dis":"水雷屯"
},{
	"code":"100010",
	"name":"蒙",
	"dis":"山水蒙"
},{
	"code":"010111",
	"name":"需",
	"dis":"水天需"
},{
	"code":"111010",
	"name":"讼",
	"dis":"天水讼"
},{
	"code":"000010",
	"name":"师",
	"dis":"地水师"
},{
	"code":"010000",
	"name":"比",
	"dis":"水地比"
},{
	"code":"110111",
	"name":"小畜",
	"dis":"风天小畜"
},{
	"code":"111011",
	"name":"履",
	"dis":"天泽履"
},{
	"code":"000111",
	"name":"泰",
	"dis":"地天泰"
},{
	"code":"111000",
	"name":"否",
	"dis":"天地否"
},{
	"code":"111101",
	"name":"同人",
	"dis":"天火同人"
},{
	"code":"101111",
	"name":"大有",
	"dis":"火天大有"
},{
	"code":"000100",
	"name":"谦",
	"dis":"地山谦"
},{
	"code":"001000",
	"name":"豫",
	"dis":"雷地豫"
},{
	"code":"011001",
	"name":"随",
	"dis":"泽雷随"
},{
	"code":"100110",
	"name":"蛊",
	"dis":"山风蛊"
},{
	"code":"000011",
	"name":"临",
	"dis":"地泽临"
},{
	"code":"110000",
	"name":"观",
	"dis":"风地观"
},{
	"code":"101001",
	"name":"噬嗑",
	"dis":"火雷噬嗑"
},{
	"code":"100101",
	"name":"贲",
	"dis":"山火贲"
},{
	"code":"100000",
	"name":"剥",
	"dis":"山地剥"
},{
	"code":"000001",
	"name":"复",
	"dis":"地雷复"
},{
	"code":"111001",
	"name":"无妄",
	"dis":"天雷无妄"
},{
	"code":"100111",
	"name":"大畜",
	"dis":"山天大畜"
},{
	"code":"100001",
	"name":"颐",
	"dis":"山雷颐"
},{
	"code":"011110",
	"name":"大过",
	"dis":"泽风大过"
},{
	"code":"010010",
	"name":"坎",
	"dis":"坎为水"
},{
	"code":"101101",
	"name":"离",
	"dis":"离为火"
},{
	"code":"011100",
	"name":"咸",
	"dis":"泽山咸"
},{
	"code":"001110",
	"name":"恒",
	"dis":"雷风恒"
},{
	"code":"111100",
	"name":"遁",
	"dis":"天山遁"
},{
	"code":"001111",
	"name":"大壮",
	"dis":"雷天大壮"
},{
	"code":"101000",
	"name":"晋",
	"dis":"火地晋"
},{
	"code":"000101",
	"name":"明夷",
	"dis":"地火明夷"
},{
	"code":"110101",
	"name":"家人",
	"dis":"风火家人"
},{
	"code":"101011",
	"name":"睽",
	"dis":"火泽睽"
},{
	"code":"010100",
	"name":"蹇",
	"dis":"水山蹇"
},{
	"code":"001010",
	"name":"解",
	"dis":"雷水解"
},{
	"code":"100011",
	"name":"损",
	"dis":"山泽损"
},{
	"code":"110001",
	"name":"益",
	"dis":"风雷益"
},{
	"code":"011111",
	"name":"夬",
	"dis":"泽天夬"
},{
	"code":"111110",
	"name":"姤",
	"dis":"天风姤"
},{
	"code":"011000",
	"name":"萃",
	"dis":"泽地萃"
},{
	"code":"000110",
	"name":"升",
	"dis":"地风升"
},{
	"code":"011010",
	"name":"困",
	"dis":"择水困"
},{
	"code":"010110",
	"name":"井",
	"dis":"水风井"
},{
	"code":"011101",
	"name":"革",
	"dis":"泽火革"
},{
	"code":"101110",
	"name":"鼎",
	"dis":"火风鼎"
},{
	"code":"001001",
	"name":"震",
	"dis":"雷为震"
},{
	"code":"100100",
	"name":"艮",
	"dis":"山为艮"
},{
	"code":"110100",
	"name":"渐",
	"dis":"风山渐"
},{
	"code":"001011",
	"name":"归妹",
	"dis":"雷泽归妹"
},{
	"code":"001101",
	"name":"丰",
	"dis":"雷火丰"
},{
	"code":"101100",
	"name":"旅",
	"dis":"火山旅"
},{
	"code":"110110",
	"name":"巽",
	"dis":"风为巽"
},{
	"code":"011011",
	"name":"兑",
	"dis":"泽为兑"
},{
	"code":"110010",
	"name":"涣",
	"dis":"风水涣"
},{
	"code":"010011",
	"name":"节",
	"dis":"水泽节"
},{
	"code":"110011",
	"name":"中孚",
	"dis":"风泽中孚"
},{
	"code":"001100",
	"name":"小过",
	"dis":"雷山小过"
},{
	"code":"010101",
	"name":"既济",
	"dis":"水火既济"
},{
	"code":"101010",
	"name":"未济",
	"dis":"火水未济"
}]