var bagua = [{
	'code': '111',
	"name": "乾",
	"num": 1,
	"main": "天",
	"wuxing": "1"
}, {
	'code': '010',
	"name": "坎",
	"num": 6,
	"main": "水",
	"wuxing": "2"
}, {
	'code': '100',
	"name": "艮",
	"num": 7,
	"main": "山",
	"wuxing": "5"
}, {
	'code': '001',
	"name": "震",
	"num": 4,
	"main": "雷",
	"wuxing": "3"
}, {
	'code': '110',
	"name": "巽",
	"num": 5,
	"main": "风",
	"wuxing": "3"
}, {
	'code': '101',
	"name": "离",
	"num": 3,
	"main": "火",
	"wuxing": "4"
}, {
	'code': '000',
	"name": "坤",
	"num": 8,
	"main": "地",
	"wuxing": "5"
}, {
	'code': '011',
	"name": "兑",
	"num": 2,
	"main": "泽",
	"wuxing": "1"
}];
var guaData = [{
	"code": "111111",
	"name": "乾",
	"main": "",
	"dis": "乾为天",
	"content": [
		"乾：元，亨，利，贞。",
		"初九：潜龙勿用。",
		"九二：见龙在田，利见大人。",
		"九三：君子终日乾乾，夕惕若厉，无咎。",
		"九四：或跃在渊，无咎。",
		"九五：飞龙在天，利见大人。",
		"上九：亢龙有悔。",
		'用九，见群龙无首，吉。'
	],
	"xiang": "象曰：天行健，君子以自强不息。",
	"exp": [
		"大吉大利",
		"龙还潜伏着，时机不成熟，还没准备好，不能轻易出手。强调事物初期要做好准备",
		"龙出现在田野上，龙伸展了，要有活动了，可以有所行动，时机基本成熟了。利益出现在面前。",
		"君子应该每日自强不息，努力，晚上高度紧张，警惕，即使遇到危险，也不会有什么大的过失。",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000000",
	"name": "坤",
	"dis": "坤为地",
	"main": "像大地一样广大，包容，顺从",
	"content": [
		"坤：元亨，利牝马之贞。君子有攸往，先迷后得主，利；西南得朋，东北丧朋，安贞吉。",
		"初六，履霜，坚冰至。",
		"六二，直方大，不习无不利。",
		"六三，含章可贞，或从王事，无成有终。",
		"六四，括囊，无咎无誉。",
		"六五，黄裳，元吉。",
		"上六，龙战于野，其血玄黄。",
		"用六，利永贞。"
	],
	"xiang": "象曰：地势坤；君子以厚德载物。",
	"exp": [
		"大吉大利，利于母马的占卜（贞）。君子（皇帝、丈夫）要干什么事，如果你（臣、妻）先于他就会迷失,如果你后于他就能得到,朋（朋友、钱），安于占卜结果就会大吉。别逞能，顺着领导，顺着大势才能永久存在。顺应。顺承。",
		"看到鞋子上有霜，意味着天冷了，要结冰了。小的错误要及早改正，不然大问题就会出现。",
		"大地直方大（包容，广阔），不实践，不行动，没有功劳也没关系，没有什么不利的。",
		"有能耐要隐藏起来，不争，不出头，让给领导。",
		"勒紧口袋，闭嘴，少说，谨慎，听话就行了，无功无过。",
		"就像黄色的裳，要知道上下，摆正自己的位置。又有文采又知道分寸。",
		"和上位者斗争（争权），两败俱伤。（有非分之想）",
		"",
	]
}, {
	"code": "010001",
	"name": "屯",
	"dis": "水雷屯",
	"xiang": "象曰：云雷，屯；君子以经纶。",
	"main": "象征小草钻出大地，起步艰难。",
	"content": [
		"屯：元亨，利贞，勿用有攸往。利建侯。",
		"初九，磐桓，利居贞，利建侯。",
		"六二，屯如，邅如，乘马班如。匪寇，婚媾。女子贞不字，十年乃字。",
		"六三，即鹿无虞，惟入于林中；君子几不如舍。往吝。",
		"六四，乘马班如，求婚媾；往吉，无不利。",
		"九五，屯其膏，小贞吉，大贞凶。",
		"上六，乘马班如，泣血涟如。"
	],
	"exp": [
		"初期不能有什么大的举动。",
		"起步中的起步，徘徊，不适合有什么大的举动。适合封赏，建候。起步要找好的队友。",
		"艰难的样子，徘徊的样子，一群人坐马的样子，匪寇，抢婚。女子暂时嫁不出去，十年之内会嫁出去的。主要说是艰难，干啥都难。但是要有信心，坚持还是有希望的",
		"追逐鹿却没有向导，迷路找不到方向；不如舍弃，如果执迷不悟会陷入困境。",
		"应初九，六二也挡不住，好爻",
		"物质不多的起步阶段，干小事还可以，如果大动作可能会失败。",
		"不好，困难，哭出血了。要变，变则通 不然就会郁郁而亡。"
	]
}, {
	"code": "100010",
	"name": "蒙",
	"dis": "山水蒙",
	"xiang": "象曰：卦中爻象犯小耗，君子占之运不高，婚姻合伙有琐碎，做事必然受苦劳。",
	"main": "幼稚的状态，蒙智	刚开始弱小但清澈单纯。容易污染，所以这个阶段要有正确的引导。强调早期教育。",
	"content": [
		"蒙：亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告，利贞。",
		"初六：发蒙，利用刑人，用说桎梏，以往吝。",
		"九二：包蒙，吉。纳妇，吉，子克家。",
		"六三：勿用取女，见金夫，不有躬，无攸利。",
		"六四：困蒙，吝。",
		"六五：童蒙，吉。",
		"上九：击蒙，不利为寇，利御寇。"
	],
	"exp": [
		"亨通。不是我去求教童蒙，而是童蒙（学生）来求教我，如果第一次问告诉他，如果三番五次的问，就不用告诉了（不能频繁的问同一个问题）",
		"启发蒙智（教育的第一步，产生兴趣、独立思考能力），利用刑人（受刑罚的人）提醒他，免得以后会受到相同的刑罚。如果你要做什么事，可能不会有好结果。 先学习先准备再做事。",
		"包容，就会好。能持家",
		"不能取这个女人，见到有钱人就不顾行为，没什么好的事。 ",
		"困住了，独自一人，没有辅助没有提携。",
		"犯了糊涂也没事，努力学习没什么问题。顺从，听从指教",
		"棍棒教育，可以很严格，但不能过于凶暴。"
	]
}, {
	"code": "010111",
	"name": "需",
	"dis": "水天需",
	"xiang": "象曰：明珠土埋日久深，无光无亮到如今，忽然大风吹土去，自然显露有重新。",
	"main": "要有所期待有所等待，天上有云，还没下雨，要耐心等待。",
	"content": [
		"需：有孚，光亨，贞吉，利涉大川。",
		"初九：需于郊，利用恒，无咎。",
		"九二：需于沙，小有言，终吉。",
		"九三：需于泥，致寇至。",
		"六四：需于血，出自穴。",
		"九五：需于酒食，贞吉。",
		"上六：入于穴，有不速之客三人来，敬之终吉。"
	],
	"exp": [
		"涉大川 度过困难  不要着急。",
		"在郊外等待的时候，要有恒心，要有耐心，没有坏处",
		"离危险近了一点，等待，稍微会有一些指责、诽谤、议论什么的不要慌，最终会好的。提示自己的修养。",
		"陷入泥里了，快接触危险了，吸引来了贼寇。不要让自己陷入这种状态（把自己的弱点、不足展露出来），否则就会比较危险。",
		"有冲突了，有损伤了，要想办法从深渊中逃出。",
		"已经跨过了困难，就快成功了，再坚持就成功了。",
		"进入了危险，有意外，要恭敬、谨慎、尊重、小心翼翼。最终会好的。"
	]
}, {
	"code": "111010",
	"name": "讼",
	"dis": "天水讼",
	"xiang": "象曰：天与水违行，讼：君子以做事谋始。",
	"main": "诉讼、争讼；要求不要争讼，不要把事情分别争辩的那么清楚，对你没好处。息争，止讼。",
	"content": [
		"讼：有孚，窒惕，中吉，终凶。利见大人，不利涉大川。",
		"初六：不永所事，小有言，终吉。",
		"九二：不克讼，归而逋。其邑人三百户，无眚。",
		"六三：食旧德，贞厉，终吉。或从王事，无成。",
		"九四：不克讼，复既命，渝。安贞，吉。",
		"九五：讼元吉。",
		"上九：或锡之鞶（pan）带，终朝三褫（chi）之。"
	],
	"exp": [
		"",
		"",
		"",
		"不要更多的争，继承祖上的家业，不要有非分之想（保持原有的道德，保持现状），过程（按你自己的想法，争的话）比较凶险，最终是吉祥的。跟从别人做事，尽职尽责按以前一样就好了。",
		"打不赢（争不赢），恢复顺应天命的安排，安于现状，吉祥",
		"中正，按天道主持中正，辩论、争讼能赢",
		"打官司打赢了，获得的利益，也不会长久。"
	]
}, {
	"code": "000010",
	"name": "师",
	"dis": "地水师",
	"xiang": "象曰：地中有水，师；君子以容民畜众。",
	"main": "战争。要民心，要主帅的能力、判断力等因素（包括选拔人才），战争才能胜利。",
	"content": [
		"师：贞，丈人吉，无咎。",
		"初六：师出以律，否臧凶。",
		"九二：在师中吉，无咎；王三锡命。",
		"六三：师或舆尸,凶。",
		"六四：师左次，无咎。",
		"六五：田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。",
		"上六：大君有命，开国承家,小人勿用。"
	],
	"exp": [
		"统帅或者长者吉祥的，没有什么过错",
		"军队出行要讲纪律，如果纪律不严格就凶。团队要讲规矩，要统一想法、意志。",
		"依天道带兵（你要在军中，稳定军心）就会吉祥，没有错误。结果不断的重任、提升。",
		"用车拉着尸体，象征失败，主帅无德无才，能力低，贪功冒进，结果就是无功惨败。",
		"条件不成熟。不要冒然出击，就没有过错",
		"田里面有兽（敌人入侵），这个时候可以出击，有利于执行你的命令，不会有什么问题（出兵时机成熟、必要的出击）。要找有能力的人出师（要选对人，不然结果不好）。",
		"论功行赏。不要用没有能力的人"
	]
}, {
	"code": "010000",
	"name": "比",
	"dis": "水地比",
	"xiang": "象曰：地上有水，比。先王以建万国，亲诸侯。",
	"main": "亲近，团结，相互亲近。不管是君还是臣都要考虑亲近团结。要团结，也要看人。",
	"content": [
		"比：吉。原筮，元永贞，无咎。不宁方来。后夫凶。",
		"初六：有孚比之，无咎。有孚盈缶，终来有它，吉。",
		"六二：比之自内，贞吉。",
		"六三：比之匪人。",
		"六四：外比之，贞吉。",
		"九五：显比，王用三驱，失前禽，邑人不诫，吉。",
		"上六：比之无首，凶。"
	],
	"exp": [
		"吉祥。元首长久的贞卜（长久的保持道德）没过错，如果你安宁了才来贞卜（还有的救）。迟了（事情已经发生了）就凶。时常要反省自己（时常要注意），不能出错了再找原因。",
		"孚：诚信、真诚。真诚的亲近，没有错误。特别真诚（满出来了），最终会有意想不到的吉祥的结果出现。",
		"发自内心的团结友爱，占卜的结果是吉祥。",
		"与道德低下的人亲近。（告诫交友谨慎。看看最近是不是认识了什么小人）",
		"不光要有团结的想法，还要有外在的实际表现。",
		"不光表现出来（团结）还有光大、发扬。打猎，从三个方向合围，跑得快的兽先跑了，不责备，吉祥。（对于小动物要友爱，方方面面都要团结，不强求，想走的就让他走。）",
		"不主动亲近，凶。"
	]
}, {
	"code": "110111",
	"name": "小畜",
	"dis": "风天小畜",
	"xiang": "象曰：风行天上，小畜。君子以懿文德。",
	"main": "臣畜君，但不能过渡。觐见的度要掌握好。积蓄、畜养。以小畜大，以臣畜君，以妇畜夫，适度，别越位。",
	"content": [
		"小畜：亨。密云不雨，自我西郊。",
		"初九：复自道，何其咎？吉。",
		"九二：牵复，吉。",
		"九三：舆说辐，夫妻反目。",
		"六四：有孚，血去惕出，无咎。",
		"九五：有孚挛如，富以其邻。",
		"上九：既雨既处，尚德载。妇贞厉，月几望。君子征凶。"
	],
	"exp": [
		"大吉大利，多云，还没下雨。在积蓄力量的阶段。",
		"回返到自己的道，能有什么过错呢？大吉大利。（恢复到自己刚建的样子）（不忘初心，找回自我）",
		"保持积极进取的状态。",
		"车没了车辐条，有冲突（要回复本心）",
		"有诚信，就能避开不好的结局，就能摆脱战战兢兢的状态。",
		"要有诚信，还要时刻把诚信放在心上，有财富与臣民共享。",
		"已经下雨了，要把握度，要控制自己，小畜之道在这停止吧。妇人占到这爻不好。月亮圆了之后就要缺了，所以要保持在快圆的状态。不能干大事，出征、扩张会凶险（还没准备好，还在准备阶段）（妇要控制夫、臣要控制君，要有度，物极必反。）"
	]
}, {
	"code": "111011",
	"name": "履",
	"dis": "天泽履",
	"xiang": "象曰：上天下泽，履；君子以辩上下，定民志。",
	"main": "小心谨慎。实践、依理而行。",
	"content": [
		"履：履虎尾，不人。亨。",
		"初九：素履往，无咎。",
		"九二：履道坦坦，幽人贞吉。",
		"六三：眇能视，跛能履。履虎尾，咥人，凶。武人为于大君。",
		"九四：履虎尾，愬愬。终吉。",
		"九五：夬履，贞厉。",
		"上九：视履考祥，其旋元吉。"
	],
	"exp": [
		"",
		"",
		"",
		"超越了自己能力，不好。",
		"在老虎后面走，要小心翼翼。最后是好的结果。",
		"果决行事，（不听取意见，过分果决、独断专行，刚愎自用），结果就不好",
		"反省自身，自我总结。结果大吉。"
	]
}, {
	"code": "000111",
	"name": "泰",
	"dis": "地天泰",
	"xiang": "象曰：天地交，泰；后以财成天地之道，辅相天地之宜，以左右民。",
	"main": "",
	"content": [
		"泰：小往大来，吉，亨。",
		"初九：拔茅茹，以其汇，征吉。",
		"九二：包荒，用冯河，不遐遗；朋亡，得尚于中行。",
		"九三：无平不陂，无往不复；艰贞无咎，勿恤其孚，于食有福。",
		"六四：翩翩，不富以其邻，不戒以孚。",
		"六五：帝乙归妹，以祉元吉。",
		"上六：“城复于隍”；勿用师，自邑告命，贞吝。"
	],
	"exp": [
		"小的走了大的来了，吉祥",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "111000",
	"name": "否",
	"dis": "天地否",
	"xiang": "象曰：天地不交，“否”；君子以俭德辟难，不可荣以禄。",
	"main": "",
	"content": [
		"否：否之匪人，不利君子贞，大往小来。",
		"初六：拔茅茹，以其汇，贞吉，亨。",
		"六二：包承，小人吉；大人否，亨。",
		"六三：包羞。",
		"九四：有命无咎，畴离祉。",
		"九五：休否，大人吉；其亡其亡，系于苞桑。",
		"上九：倾否；先否后喜。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "111101",
	"name": "同人",
	"dis": "天火同人",
	"xiang": "象曰：天与火，同人。君子以类族辨物。",
	"main": "",
	"content": [
		"同人：同人于野，亨，利涉大川，利君子贞。",
		"初九：同人于门，无咎。",
		"六二：同人于宗，吝。",
		"九三：伏戎于莽，升其高陵，三岁不兴。",
		"九四：乘其墉，弗克攻，吉主。",
		"九五：同人先号咷而后笑，大师克，相遇。",
		"上九：同人于郊，无悔。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101111",
	"name": "大有",
	"dis": "火天大有",
	"xiang": "象曰：火在天上，“大有”。君子以遏恶扬善，顺天休命。",
	"main": "",
	"content": [
		"大有：元亨。",
		"初九：无交害匪咎。艰则无咎。",
		"九二：大车以载，有攸往，无咎。",
		"九三：公用亨于天子，小人弗克。",
		"九四：匪其彭，无咎。",
		"六五：厥孚交如威如，吉。",
		"上九：自天祐之，吉，无不利。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000100",
	"name": "谦",
	"dis": "地山谦",
	"xiang": "象曰：地中有山，谦。君子以裒多益寡，称物平施。",
	"main": "",
	"content": [
		"谦：亨。君子有终。",
		"初六：谦谦君子，用涉大川，吉。",
		"六二：鸣谦，贞吉。",
		"九三：劳谦君子，有终，吉。",
		"六四：无不利，捴谦。",
		"六五：不富以其邻，利用侵伐，无不利。",
		"上六：鸣谦，利用行师征邑国。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001000",
	"name": "豫",
	"dis": "雷地豫",
	"xiang": "象曰：雷出地奋，豫。先王以作乐崇德，殷荐之上帝，以配祖考。",
	"main": "",
	"content": [
		"豫：利建侯行师。",
		"初六：鸣豫，凶。",
		"六二：介于石，不终日，贞吉。",
		"六三：盱豫，悔，迟有悔。",
		"九四：由豫，大有得，勿疑。朋盍簪。",
		"六五：贞疾，恒不死。",
		"上六：冥豫，成有渝。无咎。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011001",
	"name": "随",
	"dis": "泽雷随",
	"xiang": "象曰：泽中有雷，随。君子以向晦入宴息。",
	"main": "",
	"content": [
		"随：元亨，利贞，无咎。",
		"初九：官有渝，贞吉，出门交有功。",
		"六二：系小子，失丈夫。",
		"六三：系丈夫，失小子，随有求，得。利居贞。",
		"九四：随有获，贞凶。有孚在道，以明，何咎？",
		"九五：孚于嘉，吉。",
		"上六：拘系之，乃従维之，王用亨于西山。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100110",
	"name": "蛊",
	"dis": "山风蛊",
	"xiang": "象曰：山下有风，蛊。君子以振民育德。",
	"main": "",
	"content": [
		"蛊：元亨。利涉大川，先甲三日，后甲三日。",
		"初六：干父之蛊，有子，考无咎。厉，终吉。",
		"九二：干母之蛊，不可贞。",
		"九三：干父之蛊，小有悔，无大咎。",
		"六四：裕父之蛊，往见吝。",
		"六五：干父之蛊，用誉。",
		"上九：不事王侯，高尚其事。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000011",
	"name": "临",
	"dis": "地泽临",
	"xiang": "象曰：泽上有地，临；君子以教思无穷，容保民无疆。",
	"main": "",
	"content": [
		"临：元，亨，利，贞。至于八月有凶。",
		"初九：咸临，贞吉。",
		" 九二：咸临，吉无不利。",
		"六三：甘临，无攸利。既忧之，无咎。",
		"六四：至临，无咎。",
		"六五：知临，大君之宜，吉。",
		"上六：敦临，吉无咎。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110000",
	"name": "观",
	"dis": "风地观",
	"xiang": "象曰：风行地上，观；先王以省方，观民设教。",
	"main": "",
	"content": [
		"观：盥而不荐，有孚顒若。",
		"初六：童观，人无咎，君子吝。",
		"六二：窥观，利女贞。",
		"六三：观我生，进退。",
		"六四：观国之光，利用宾于王。",
		"九五：观我生，君子无咎。",
		"上九：观其生，君子无咎。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101001",
	"name": "噬嗑",
	"dis": "火雷噬嗑",
	"xiang": "象曰：雷电噬嗑；先王以明罚敕法。",
	"main": "",
	"content": [
		"噬嗑：亨。利用狱。",
		"初九：履校灭趾，无咎。",
		"六二：噬肤灭鼻，无咎。",
		"六三：噬腊肉，遇毒；吝，无咎。",
		"九四：噬乾胏，得金矢，利艰贞，吉。",
		"六五：噬乾肉，得黄金，贞厉，无咎。",
		"上九：何校灭耳，凶。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100101",
	"name": "贲",
	"dis": "山火贲",
	"xiang": "象曰：山下有火，贲；君子以明庶政，无敢折狱。",
	"main": "",
	"content": [
		"贲：亨。利有所往。",
		"初九：贲其趾，舍车而徒。",
		"六二：贲其须。",
		"九三：贲如濡如，永贞吉。",
		"六四：贲如皤如，白马翰如，匪寇婚媾。",
		"六五：贲于丘园，束帛戋戋，吝，终吉。",
		"上九：白贲，无咎。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100000",
	"name": "剥",
	"dis": "山地剥",
	"xiang": "象曰：山附地上，剥；上以厚下，安宅。",
	"main": "",
	"content": [
		"剥：不利有攸往。",
		"初六：剥牀以足，蔑贞凶。",
		"六二：剥牀以辨，蔑贞凶。",
		"六三：剥之，无咎。",
		"六四：剥牀以肤，凶。",
		"六五：贯鱼，以宫人宠，无不利。",
		"上九：硕果不食，君子得舆，人剥庐。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000001",
	"name": "复",
	"dis": "地雷复",
	"xiang": "象曰：雷在地中，复；先王以至日闭关，商旅不行，后不省方。",
	"main": "",
	"content": [
		"复：亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。",
		"初九：不复远，无只悔，元吉。",
		"六二：休复，吉。",
		"六三：频复，厉无咎。",
		"六四：中行独复。",
		"六五：敦复，无悔。",
		"上六：迷复，凶，有灾眚。用行师，终有大败，以其国君，凶；至于十年，不克征。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "111001",
	"name": "无妄",
	"dis": "天雷无妄",
	"xiang": "象曰：天下雷行，物与无妄；先王以茂对时，育万物。",
	"main": "",
	"content": [
		"无妄：元，亨，利，贞。其匪正有眚，不利有攸往。",
		"初九：无妄，往吉。",
		"六二：不耕获，不菑畲，则利有攸往。",
		"六三：无妄之灾，或系之牛，行人之得，邑人之灾。",
		"九四：可贞，无咎。",
		"九五：无妄之疾，勿药有喜。",
		"上九：无妄，行有眚，无攸利。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100111",
	"name": "大畜",
	"dis": "山天大畜",
	"xiang": "象曰：天在山中，大畜；君子以多识前言往行，以畜其德。",
	"main": "",
	"content": [
		"大畜：利贞，不家食吉，利涉大川。",
		"初九：有厉利已。",
		"九二：舆辐。",
		"九三：良马逐，利艰贞。曰闲舆卫，利有攸往。",
		"六四：童豕之牿，元吉。",
		"六五：豮豕之牙，吉。",
		"上九：何天之衢，亨。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100001",
	"name": "颐",
	"dis": "山雷颐",
	"xiang": "象曰：山下有雷，颐；君子以慎言语，节饮食。",
	"main": "",
	"content": [
		"颐：贞吉。观颐，自求口实。",
		"初九：舍尔灵龟，观我朵颐，凶。",
		"六二：颠颐，拂经，于丘颐，征凶。",
		"六三：拂颐，贞凶，十年勿用，无攸利。",
		"六四：颠颐吉，虎视眈眈，其欲逐逐，无咎。",
		"六五：拂经，居贞吉，不可涉大川。",
		"上九：由颐，厉吉，利涉大川。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011110",
	"name": "大过",
	"dis": "泽风大过",
	"xiang": "象曰：泽灭木，大过；君子以独立不惧，遯世无闷。",
	"main": "",
	"content": [
		"大过：栋桡，利有攸往，亨。",
		"初六：藉用白茅，无咎。",
		"九二：枯杨生祶，老夫得其女妻，无不利。",
		"九三：栋桡，凶。",
		"九四：栋隆，吉；有它吝。",
		"九五：枯杨生华，老妇得士夫，无咎无誉。",
		"上六：过涉灭顶，凶，无咎。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "010010",
	"name": "坎",
	"dis": "坎为水",
	"xiang": "象曰：水洊至，习坎；君子以常德行，习教事。",
	"main": "",
	"content": [
		"坎：习坎，有孚，维心亨，行有尚。",
		"初六：习坎，入于坎錎，凶。",
		"九二：坎有险，求得。",
		"六三：来之坎坎，险且枕，入于坎錎，勿用。",
		"六四：樽酒簋贰，用缶，纳约自牖，终无咎。",
		"九五：坎不盈，只既平，无咎。",
		"上六：系用徽纒，置于丛棘，三岁不得，凶。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101101",
	"name": "离",
	"dis": "离为火",
	"xiang": "象曰：明两作离，大人以继明照于四方。",
	"main": "",
	"content": [
		"离：利贞，亨。畜牝牛，吉。",
		"初九：履错然，敬之无咎。",
		"六二：黄离，元吉。",
		"九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。",
		"九四：突如其来如，焚如，死如，弃如。",
		"六五：出涕沱若，戚嗟若，吉。",
		"上九：王用出征，有嘉折首，获其匪丑，无咎。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011100",
	"name": "咸",
	"dis": "泽山咸",
	"xiang": "象曰：山上有泽，咸；君子以虚受人。",
	"main": "",
	"content": [
		"咸：亨，利贞，取女吉。",
		"初六：咸其拇。",
		"六二：咸其腓，凶，居吉。",
		"九三：咸其股，执其随，往吝。",
		"九四：贞吉悔亡，憧憧往来，朋从尔思。",
		"九五：咸其脢，无悔。",
		"上六：咸其辅，颊，舌。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001110",
	"name": "恒",
	"dis": "雷风恒",
	"xiang": "象曰：雷风，恒；君子以立不易方。",
	"main": "",
	"content": [
		" 恒：亨，无咎，利贞，利有攸往。",
		"初六：浚恒，贞凶，无攸利。",
		"九二：悔亡。",
		"九三：不恒其德，或承之羞，贞吝。",
		"九四：田无禽。",
		"六五：恒其德，贞，妇人吉，夫子凶。",
		"上六：振恒，凶。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "111100",
	"name": "遯",
	"dis": "天山遁",
	"xiang": "象曰：天下有山，遯；君子以远人，不恶而严。",
	"main": "",
	"content": [
		"遯：亨，利贞。",
		"初六：遯尾，厉，勿用有攸往。",
		"六二：执之用黄牛之革，莫之胜。",
		"九三：系遯，有疾厉，畜臣妾吉。",
		"九四：好遯君子吉，人否。",
		"九五：嘉遯，贞吉。",
		"上九：肥遯，无不利。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001111",
	"name": "大壮",
	"dis": "雷天大壮",
	"xiang": "象曰：雷在天上，大壮；君子以非礼勿履。",
	"main": "",
	"content": [
		"大壮：利贞。",
		"初九：壮于趾，征凶，有孚。",
		"九二：贞吉。",
		"九三：人用壮，君子用罔，贞厉。羝羊触藩，羸其角。",
		"九四：贞吉悔亡，藩决不羸，壮于大舆之輹。",
		"六五：丧羊于易，无悔。",
		"上六：羝羊触藩，不能退，不能遂，无攸利，艰则吉。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101000",
	"name": "晋",
	"dis": "火地晋",
	"xiang": "象曰：明出地上，晋；君子以自昭明德。",
	"main": "",
	"content": [
		"晋：康侯用锡马蕃庶，昼日三接。",
		"初六：晋如，摧如，贞吉。罔孚，裕无咎。",
		"六二：晋如，愁如，贞吉。受兹介福，于其王母。",
		"六三：众允，悔亡。",
		"九四：晋如硕鼠，贞厉。",
		"六五：悔亡，失得勿恤，往吉无不利。",
		"上九：晋其角，维用伐邑，厉吉无咎，贞吝。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000101",
	"name": "明夷",
	"dis": "地火明夷",
	"xiang": "象曰：明入地中，明夷；君子以莅众，用晦而明。",
	"main": "",
	"content": [
		"明夷：利艰贞。",
		"初九：明夷于飞，垂其翼。君子于行，三日不食，有攸往，主人有言。",
		"六二：明夷，夷于左股，用拯马壮，吉。",
		"九三：明夷于南狩，得其大首，不可疾贞。",
		"六四：入于左腹，获明夷之心，出于门庭。",
		"六五：箕子之明夷，利贞。",
		"上六：不明晦，初登于天，后入于地。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110101",
	"name": "家人",
	"dis": "风火家人",
	"xiang": "象曰：风自火出，家人；君子以言有物，而行有恒。",
	"main": "",
	"content": [
		"家人：利女贞。",
		"初九：闲有家，悔亡。",
		"六二：无攸遂，在中馈，贞吉。",
		"九三：家人鎬鎬，悔厉吉；妇子嘻嘻，终吝。",
		"六四：富家，大吉。",
		"九五：王假有家，勿恤吉。",
		"上九：有孚威如，终吉。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101011",
	"name": "睽",
	"dis": "火泽睽",
	"xiang": "象曰：上火下泽，睽；君子以同而异。",
	"main": "",
	"content": [
		"睽：事吉。",
		"初九：悔亡，丧马勿逐，自复；见恶人无咎。",
		"九二：遇主于巷，无咎。",
		"六三：见舆曳，其牛掣，其人天且劓，无初有终。",
		"九四：睽孤，遇元夫，交孚，厉无咎。",
		"六五：悔亡，厥宗噬肤，往何咎。",
		"上九：睽孤，见豕负涂，载鬼一车，先张之弧，后之弧，匪寇婚媾，往遇雨则吉。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "010100",
	"name": "蹇",
	"dis": "水山蹇",
	"xiang": "象曰：山上有水，蹇；君子以反身修德。",
	"main": "",
	"content": [
		"蹇：利西南，不利东北；利见大人，贞吉。",
		"初六：往蹇，来誉。",
		"六二：王臣蹇蹇，匪躬之故。",
		"九三：往蹇来反。",
		"六四：往蹇来连。",
		"九五：大蹇朋来。",
		"上六：往蹇来硕，吉；利见大人。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001010",
	"name": "解",
	"dis": "雷水解",
	"xiang": "象曰：雷雨作，解；君子以赦过宥罪。",
	"main": "",
	"content": [
		"解：利西南，无所往，其来复吉。有攸往，夙吉。",
		"初六：无咎。",
		"九二：田获三狐，得黄矢，贞吉。",
		"六三：负且乘，致寇至，贞吝。",
		"九四：解而拇，朋至斯孚。",
		"六五：君子维有解，吉；有孚于人。",
		"上六：公用射隼，于高墉之上，获之，无不利。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100011",
	"name": "损",
	"dis": "山泽损",
	"xiang": "象曰：山下有泽，损；君子以惩忿窒欲。",
	"main": "",
	"content": [
		"损：有孚，元吉，无咎，可贞，利有攸往？曷之用，二簋可用享。",
		"初九：已事遄往，无咎，酌损之。",
		"九二：利贞，征凶，弗损益之。",
		"六三：三人行，则损一人；一人行，则得其友。",
		"六四：损其疾，使遄有喜，无咎。",
		"六五：或益之，十朋之龟弗克违，元吉。",
		"上九：弗损益之，无咎，贞吉，利有攸往，得臣无家。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110001",
	"name": "益",
	"dis": "风雷益",
	"xiang": "象曰：风雷，益；君子以见善则迁，有过则改。",
	"main": "",
	"content": [
		"益：利有攸往，利涉大川。",
		"初九：利用为大作，元吉，无咎。",
		"六二：或益之，十朋之龟弗克违，永贞吉。王用享于帝，吉。",
		"六三：益之用凶事，无咎。有孚中行，告公用圭。",
		"六四：中行，告公从。利用为依迁国。",
		"九五：有孚惠心，勿问元吉。有孚惠我德。",
		"上九：莫益之，或击之，立心勿恒，凶。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011111",
	"name": "夬",
	"dis": "泽天夬",
	"xiang": "象曰：泽上于天，夬；君子以施禄及下，居德则忌。",
	"main": "",
	"content": [
		"夬：扬于王庭，孚号，有厉，告自邑，不利即戎，利有攸往。",
		"初九：壮于前趾，往不胜为吝。",
		"九二：惕号，莫夜有戎，勿恤。",
		"九三：壮于，有凶。君子夬夬，独行遇雨，若濡有愠，无咎。",
		"九四：臀无肤，其行次且。牵羊悔亡，闻言不信。",
		"九五：苋陆夬夬，中行无咎。",
		"上六：无号，终有凶。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "111110",
	"name": "姤",
	"dis": "天风姤",
	"xiang": "象曰：天下有风，姤；后以施命诰四方。",
	"main": "",
	"content": [
		"姤：女壮，勿用取女。",
		"初六：系于金柅，贞吉，有攸往，见凶，羸豕踟躅。",
		"九二：包有鱼，无咎，不利宾。",
		"九三：臀无肤，其行次且，厉，无大咎。",
		"九四：包无鱼，起凶。",
		"九五：以杞包瓜，含章，有陨自天。",
		"上九：姤其角，吝，无咎。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011000",
	"name": "萃",
	"dis": "泽地萃",
	"xiang": "象曰：泽上於地，萃；君子以除戎器，戒不虞。",
	"main": "",
	"content": [
		"萃：亨。王假有庙，利见大人，亨，利贞。用大牲吉，利有攸往。",
		"初六：有孚不终，乃乱乃萃，若号一握为笑，勿恤，往无咎。",
		"六二：引吉，无咎，孚乃利用禴。",
		"六三：萃如，嗟如，无攸利，往无咎，吝。",
		"九四：大吉，无咎。",
		"九五：萃有位，无咎。匪孚，元永贞，悔亡。",
		"上六：齑咨涕洟，无咎。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "000110",
	"name": "升",
	"dis": "地风升",
	"xiang": "象曰：地中生木，升；君子以顺德，积以高大。",
	"main": "",
	"content": [
		"升：元亨，用见大人，勿恤，南征吉。",
		"初六：允升，大吉。",
		"九二：孚乃利用禴，无咎。",
		"九三：升虚邑。",
		"六四：王用亨于岐山，吉无咎。",
		"六五：贞吉，升阶。",
		"上六：冥升，利于不息之贞。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011010",
	"name": "困",
	"dis": "择水困",
	"xiang": "象曰：泽无水，困；君子以致命遂志。",
	"main": "",
	"content": [
		"困：亨，贞，大人吉，无咎，有言不信。",
		"初六：臀困于株木，入于幽谷，三岁不见。",
		"九二：困于酒食，朱绂方来，利用亨祀，征凶，无咎。",
		"六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。",
		"九四：来徐徐，困于金车，吝，有终。",
		"九五：劓刖，困于赤绂，乃徐有，利用祭祀。",
		"上六：困于葛藟，于臲靰，曰动悔。有悔，征吉。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "010110",
	"name": "井",
	"dis": "水风井",
	"xiang": "象曰：木上有水，井；君子以劳民劝相。",
	"main": "",
	"content": [
		"井：改邑不改井，无丧无得，往来井井。汔至，亦未蹫井，羸其瓶，凶。",
		"初六：井泥不食，旧井无禽。",
		"九二：井谷射鲋，瓮敝漏。",
		"九三：井渫不食，为我民恻，可用汲，王明，并受其福。",
		"六四：井甃，无咎。",
		"九五：井冽，寒泉食。",
		"上六：井收勿幕，有孚无吉。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011101",
	"name": "革",
	"dis": "泽火革",
	"xiang": "象曰：泽中有火，革；君子以治历明时。",
	"main": "",
	"content": [
		"革：己日乃孚，元亨利贞，悔亡。",
		"初九：巩用黄牛之革。",
		"六二：己日乃革之，征吉，无咎。",
		"九三：征凶，贞厉，革言三就，有孚。",
		"九四：悔亡，有孚改命，吉。",
		"九五：大人虎变，未占有孚。",
		"上六：君子豹变，人革面，征凶，居贞吉。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101110",
	"name": "鼎",
	"dis": "火风鼎",
	"xiang": "象曰：木上有火，鼎；君子以正位凝命。",
	"main": "",
	"content": [
		"鼎：元吉，亨。",
		"初六：鼎颠趾，利出否，得妾以其子，无咎。",
		"九二：鼎有实，我仇有疾，不我能即，吉。",
		"九三：鼎耳革，其行塞，雉膏不食，方雨亏悔，终吉。",
		"九四：鼎折足，覆公餗，其形渥，凶。",
		"六五：鼎黄耳金铉，利贞。",
		"上九：鼎玉铉，大吉，无不利。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001001",
	"name": "震",
	"dis": "雷为震",
	"xiang": "象曰：洊雷，震；君子以恐惧修身。",
	"main": "",
	"content": [
		"震：亨。震来萀萀，笑言哑哑。震惊百里，不丧匕鬯。",
		"初九：震来萀萀，后笑言哑哑，吉。",
		"六二：震来厉，亿丧贝，跻于九陵，勿逐，七日得。",
		"六三：震苏苏，震行无眚。",
		"九四：震遂泥。",
		"六五：震往来厉，亿无丧，有事。",
		"上六：震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "100100",
	"name": "艮",
	"dis": "山为艮",
	"xiang": "象曰：兼山，艮；君子以思不出其位。",
	"main": "",
	"content": [
		"艮：艮其背，不获其身，行其庭，不见其人，无咎。",
		"初六：艮其趾，无咎，利永贞。",
		"六二：艮其腓，不拯其随，其心不快。",
		"九三：艮其限，列其夤，厉薰心。",
		"六四：艮其身，无咎。",
		"六五：艮其辅，言有序，悔亡。",
		"上九：敦艮，吉。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110100",
	"name": "渐",
	"dis": "风山渐",
	"xiang": "象曰：山上有木，渐；君子以居贤德，善俗。",
	"main": "",
	"content": [
		"渐：女归吉，利贞。",
		"初六：鸿渐于干，子厉，有言，无咎。",
		"六二：鸿渐于磐，饮食衎衎，吉。",
		"九三：鸿渐于陆，夫征不复，妇孕不育，凶；利御寇。",
		"六四：鸿渐于木，或得其桷，无咎。",
		"九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。",
		"上九：鸿渐于逵，其羽可用为仪，吉。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001011",
	"name": "归妹",
	"dis": "雷泽归妹",
	"xiang": "象曰：泽上有雷，归妹；君子以永终知敝。",
	"main": "",
	"content": [
		"归妹：征凶，无攸利。",
		"初九：归妹以娣，跛能履，征吉。",
		"九二：眇能视，利幽人之贞。",
		"六三：归妹以须，反归以娣。",
		"九四：归妹愆期，迟归有时。",
		"六五：帝乙归妹，其君之袂，不如其娣之袂良，月几望，吉。",
		"上六：女承筐无实，士刲羊无血，无攸利。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001101",
	"name": "丰",
	"dis": "雷火丰",
	"xiang": "象曰：雷电皆至，丰；君子以折狱致刑。",
	"main": "",
	"content": [
		"丰：亨，王假之，勿忧，宜日中。",
		"初九：遇其配主，虽旬无咎，往有尚。",
		"六二：丰其蔀，日中见斗，往得疑疾，有孚发若，吉。",
		"九三：丰其沛，日中见昧，折其右肱，无咎。",
		"九四：丰其蔀，日中见斗，遇其夷主，吉。",
		"六五：来章，有庆誉，吉。",
		"上六：丰其屋，蔀其家，窥其户，阒其无人，三岁不见，凶。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101100",
	"name": "旅",
	"dis": "火山旅",
	"xiang": "象曰：山上有火，旅；君子以明慎用刑，而不留狱。",
	"main": "",
	"content": [
		"旅：亨，旅贞吉。",
		"初六：旅琐琐，斯其所取灾。",
		"六二：旅即次，怀其资，得童仆贞。",
		"九三：旅焚其次，丧其童仆，贞厉。",
		"九四：旅于处，得其资斧，我心不快。",
		"六五：射雉一矢亡，终以誉命。",
		"上九：鸟焚其巢，旅人先笑后号啕。丧牛于易，凶。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110110",
	"name": "巽",
	"dis": "风为巽",
	"xiang": "象曰：随风，巽；君子以申命行事。",
	"main": "",
	"content": [
		"巽：亨，利攸往，利见大人。",
		"初六：进退，利武人之贞。",
		"九二：巽在□下，用史巫纷若，吉无咎。",
		"九三：频巽，吝。",
		"六四：悔亡，田获三品。",
		"九五：贞吉悔亡，无不利。无初有终，先庚三日，后庚三日，吉。",
		"上九：巽在□下，丧其资斧，贞凶。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "011011",
	"name": "兑",
	"dis": "泽为兑",
	"xiang": "象曰：丽泽，兑；君子以朋友讲习。",
	"main": "",
	"content": [
		"兑：亨，利贞。",
		"初九：和兑，吉。",
		"九二：孚兑，吉，悔亡。",
		"六三：来兑，凶。",
		"九四：商兑，未宁，介疾有喜。",
		"九五：孚于剥，有厉。",
		"上六：引兑。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110010",
	"name": "涣",
	"dis": "风水涣",
	"xiang": "象曰：风行水上，涣；先王以享于帝立庙。",
	"main": "",
	"content": [
		"涣：亨。王假有庙，利涉大川，利贞。",
		"初六：用拯马壮，吉。",
		"九二：涣奔其机，悔亡。",
		"六三：涣其躬，无悔。",
		"六四：涣其群，元吉。涣有丘，匪夷所思。",
		"九五：涣汗其大号，涣王居，无咎。",
		"上九：涣其血，去逖出，无咎。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "010011",
	"name": "节",
	"dis": "水泽节",
	"xiang": "象曰：泽上有水，节；君子以制数度，议德行。",
	"main": "",
	"content": [
		"节：亨。苦节不可贞。",
		"初九：不出户庭，无咎。",
		"九二：不出门庭，凶。",
		"六三：不节若，则嗟若，无咎。",
		"六四：安节，亨。",
		"九五：甘节，吉；往有尚。",
		"上六：苦节，贞凶，悔亡。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "110011",
	"name": "中孚",
	"dis": "风泽中孚",
	"xiang": "象曰：泽上有风，中孚；君子以议狱缓死。",
	"main": "",
	"content": [
		"中孚：豚鱼吉，利涉大川，利贞。",
		"初九：虞吉，有他不燕。",
		"九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。",
		"六三：得敌，或鼓或罢，或泣或歌。",
		"六四：月几望，马匹亡，无咎。",
		"九五：有孚挛如，无咎。",
		"上九：翰音登于天，贞凶。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "001100",
	"name": "小过",
	"dis": "雷山小过",
	"xiang": "象曰：山上有雷，过；君子以行过乎恭，丧过乎哀，用过乎俭。",
	"main": "",
	"content": [
		"过：亨，利贞，可事，不可大事。飞鸟遗之音，不宜上宜下，大吉。",
		"初六：飞鸟以凶。",
		"六二：过其祖，遇其妣；不及其君，遇其臣；无咎。",
		"九三：弗过防之，从或戕之，凶。",
		"九四：无咎，弗过遇之。往厉必戒，勿用永贞。",
		"六五：密云不雨，自我西郊，公弋取彼在穴。",
		"上六：弗遇过之，飞鸟离之，凶，是谓灾眚。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "010101",
	"name": "既济",
	"dis": "水火既济",
	"xiang": "象曰：水在火上，既济；君子以思患而预防之。",
	"main": "",
	"content": [
		"既济：亨，利贞，初吉终乱。",
		"初九：曳其轮，濡其尾，无咎。",
		"六二：妇丧其髴，勿逐，七日得。",
		"九三：高宗伐鬼方，三年克之，人勿用。",
		"六四：繻有衣袽，终日戒。",
		"九五：东邻杀牛，不如西邻之禴祭，实受其福。",
		"上六：濡其首，厉。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}, {
	"code": "101010",
	"name": "未济",
	"dis": "火水未济",
	"xiang": "象曰：火在水上，未济；君子以慎辨物居方。",
	"main": "",
	"content": [
		"未济：亨，狐汔济，濡其尾，无攸利。",
		"初六：濡其尾，吝。",
		"九二：曳其轮，贞吉。",
		"六三：未济，征凶，利涉大川。",
		"九四：贞吉，悔亡，震用伐鬼方，三年有赏于大国。",
		"六五：贞吉，无悔，君子之光，有孚，吉。",
		"上九：有孚于饮酒，无咎，濡其首，有孚失是。"
	],
	"exp": [
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}]
